Importar las bibliotecas necesarias

In [1]:
!pip install findspark

Collecting findspark
  Using cached findspark-2.0.1-py2.py3-none-any.whl (4.4 kB)
Installing collected packages: findspark
Successfully installed findspark-2.0.1

In [2]:
import findspark
findspark.init()

Crear una instancia de SparkSession

In [3]:
import pyspark

In [5]:
from pyspark.sql import SparkSession

In [6]:
spark = SparkSession.builder\
        .master("local[*]")\
        .appName('taller_big_data_developer')\
        .getOrCreate() #devuelve una sesion existente sino existe la crea

1. Crear un DataFrame con datos de personas, que incluya nombre, edad y ciudad de residencia.

In [12]:
from pyspark.sql.types import *

In [13]:
data_schema = [
               StructField('nombre', StringType(), True),
               StructField('edad', IntegerType(), True),
               StructField('ciudad', StringType(), True)
            ]

final_struc = StructType(fields=data_schema)

In [14]:
#Leemos un cvs
#df = spark.read.option("header", "true").csv("C:/Users/LTEC-IFLOR-LEASING/Documents/Frio Express/6. Cursos y capacitación/Data Engienner/Big Data Developer/Taller/Dataset_taller.csv")
df = spark.read.csv(
    "C:/Users/LTEC-IFLOR-LEASING/Documents/Frio Express/6. Cursos y capacitación/Data Engienner/Big Data Developer/Taller/Dataset_taller.csv",
    sep = ',',
    header = True,
    schema = final_struc
    )

In [16]:
df.printSchema()

root
 |-- nombre: string (nullable = true)
 |-- edad: integer (nullable = true)
 |-- ciudad: string (nullable = true)

In [17]:
df.show(10)

+----------+----+-----------+
|    nombre|edad|     ciudad|
+----------+----+-----------+
|  SANTIAGO|  60|      Tokyo|
|     MATEO|  13|    Jakarta|
|     SOFIA|  63|      Delhi|
| SEBASTIAN|  26|  Guangzhou|
|MARIA JOSE|  51|     Mumbai|
|  LEONARDO|  15|     Manila|
| VALENTINA|  21|   Shanghai|
|    REGINA|  25|  Sao Paulo|
|    XIMENA|  37|      Seoul|
|    MATIAS|  71|Mexico City|
+----------+----+-----------+
only showing top 10 rows

2. Mostrar solo los nombres de las personas del DataFrame.

In [18]:
df.select('nombre').distinct().show(10)

+-----------------+
|           nombre|
+-----------------+
|       JUAN PABLO|
|        JUAN JOSE|
|             JADE|
|       IAN DANIEL|
|SANTIAGO DE JESUS|
|            AILYN|
|     LUIS ROBERTO|
|          EMANUEL|
|    ZOE VALENTINA|
|      JESUS ANGEL|
+-----------------+
only showing top 10 rows

3. Filtrar personas cuya edad sea mayor o igual a 25.

In [19]:
from pyspark.sql.functions import when
df.filter(df.edad >= '25').show(100)

+---------------+----+----------------+
|         nombre|edad|          ciudad|
+---------------+----+----------------+
|       SANTIAGO|  60|           Tokyo|
|          SOFIA|  63|           Delhi|
|      SEBASTIAN|  26|       Guangzhou|
|     MARIA JOSE|  51|          Mumbai|
|         REGINA|  25|       Sao Paulo|
|         XIMENA|  37|           Seoul|
|         MATIAS|  71|     Mexico City|
|          DIEGO|  58|           Dhaka|
| MARIA FERNANDA|  41|         Beijing|
|         DANIEL|  39|         Bangkok|
|        VALERIA|  37|        Shenzhen|
|       VICTORIA|  29|    Buenos Aires|
|      ALEXANDER|  27|           Lagos|
|      ALEJANDRO|  43|        Istanbul|
|           GAEL|  48|         Karachi|
|          JESUS|  61|       Bangalore|
|        DANIELA|  54|           Osaka|
|       ISABELLA|  49|         Chengdu|
|          ANGEL|  50|        Kinshasa|
|          DAVID|  26|  Rio de Janeiro|
|     LUIS ANGEL|  58|         Chennai|
|       FERNANDO|  68|           Xi'an|
|MARIA GUADALUPE|  59|       Chongqing|
|       FERNANDA|  70|         Baoding|
|      JOSE LUIS|  51|          London|
|          ALEXA|  26|           Paris|
|        RODRIGO|  62|           Linyi|
|     JUAN PABLO|  40|           Wuhan|
|        GABRIEL|  49|         Nanyang|
|       SAMANTHA|  41|        Hangzhou|
|          DYLAN|  62|          Foshan|
|      GUADALUPE|  69|          Nagoya|
|    JUAN CARLOS|  29|          Taipei|
|         RAFAEL|  40|         Ganzhou|
|    JOSE MANUEL|  31|    Kuala Lumpur|
|          ISAAC|  47|            Heze|
|      ELIZABETH|  34|         Chicago|
|        RICARDO|  47|         Nanjing|
|         SAMUEL|  34|          Jining|
|           IKER|  39|           Hanoi|
|         LEONEL|  32|          Fuyang|
|       YAMILETH|  54|        Shenyang|
|           ALAN|  33|        Khartoum|
|          ELIAS|  31|        Cangzhou|
|        NICOLAS|  48|       Hong Kong|
|         FATIMA|  53|        Shaoyang|
|          EMILY|  31|        Yancheng|
|  ANGEL GABRIEL|  53|        Hengyang|
|       CRISTIAN|  64|       Zhumadian|
|         ADRIAN|  42|        Santiago|
|         CARLOS|  55|         Xingtai|
|  LUIS FERNANDO|  69|      Chattogram|
|         JAVIER|  35|           Zunyi|
|          JOSUE|  34|        Surabaya|
|   JOSE ANTONIO|  66|       Huanggang|
|    JOSE MIGUEL|  48|        Nanchong|
|      ESMERALDA|  26|         Xinyang|
|        VANESSA|  30|          Madrid|
|         MIGUEL|  70|         Baghdad|
|         EVELYN|  30|          Qujing|
|          URIEL|  36|         Jieyang|
|      ESTEFANIA|  30|       Singapore|
|          AARON|  46|       Prayagraj|
|         JIMENA|  65|       Liaocheng|
|         ANDRES|  30|           Yulin|
|      ANA PAULA|  51|         Changde|
|     JUAN DIEGO|  37|         Qingdao|
|         JULIAN|  43|          Douala|
|         MANUEL|  55|           Miami|
|         BRAYAN|  28|       Nangandao|
|          PEDRO|  41|          Pudong|
|        ALONDRA|  64|       Xiangyang|
|        LUCIANA|  32|          Dallas|
|          KEVIN|  45|         Houston|
|        GERARDO|  30|           Lu'an|
|        MIRANDA|  38|          Dezhou|
|         ISMAEL|  53|           Jinan|
|           IVAN|  32|            Giza|
|        ROBERTO|  45|        Zhaotong|
|     JOSE MARIA|  36|          Yichun|
|      JUAN JOSE|  50|         Nairobi|
|          MARIA|  45|     Guadalajara|
|    DULCE MARIA|  67|    Philadelphia|
|           LIAM|  32|          Ankara|
|          ERICK|  51|          Tai'an|
|           JOSE|  65|          Dazhou|
|  MARCO ANTONIO|  32|Saint Petersburg|
|       CAROLINA|  39|         Qiqihar|
|      MONSERRAT|  58|       Monterrey|
|  CARLOS DANIEL|  46|  Belo Horizonte|
|    DANNA SOFIA|  38|          Weinan|
|         IVANNA|  43|       Zhangzhou|
|         ISRAEL|  34|        Yuncheng|
|SOFIA GUADALUPE|  53|         Atlanta|
|         OLIVER|  66|          Bozhou|
|           SAUL|  41|         Abidjan|
|        PAULINA|  40|         Huaihua|
|          ABRIL|  41|     Xiaoganzhan|
|           OMAR|  42|    Pingdingshan|
|          BRUNO|  55|      Alexandria|
+---------------+----+----------------+
only showing top 100 rows

4. Agregar una nueva columna "Pais" con un valor constante para todas las filas.

In [21]:
from pyspark.sql.functions import lit

In [23]:
df.withColumn('Pais',lit('Mexico')).show(100)

+---------------+----+----------------+------+
|         nombre|edad|          ciudad|  Pais|
+---------------+----+----------------+------+
|       SANTIAGO|  60|           Tokyo|Mexico|
|          MATEO|  13|         Jakarta|Mexico|
|          SOFIA|  63|           Delhi|Mexico|
|      SEBASTIAN|  26|       Guangzhou|Mexico|
|     MARIA JOSE|  51|          Mumbai|Mexico|
|       LEONARDO|  15|          Manila|Mexico|
|      VALENTINA|  21|        Shanghai|Mexico|
|         REGINA|  25|       Sao Paulo|Mexico|
|         XIMENA|  37|           Seoul|Mexico|
|         MATIAS|  71|     Mexico City|Mexico|
|         CAMILA|   4|           Cairo|Mexico|
|       EMILIANO|   4|        New York|Mexico|
|          DIEGO|  58|           Dhaka|Mexico|
| MARIA FERNANDA|  41|         Beijing|Mexico|
|   MIGUEL ANGEL|  18|         Kolkata|Mexico|
|         DANIEL|  39|         Bangkok|Mexico|
|        VALERIA|  37|        Shenzhen|Mexico|
|         RENATA|  23|          Moscow|Mexico|
|       VICTORIA|  29|    Buenos Aires|Mexico|
|      ALEXANDER|  27|           Lagos|Mexico|
|      ALEJANDRO|  43|        Istanbul|Mexico|
|           GAEL|  48|         Karachi|Mexico|
|          JESUS|  61|       Bangalore|Mexico|
|        NATALIA|   4|Ho Chi Minh City|Mexico|
|        DANIELA|  54|           Osaka|Mexico|
|       ISABELLA|  49|         Chengdu|Mexico|
|         ROMINA|   4|          Tehran|Mexico|
|          ANGEL|  50|        Kinshasa|Mexico|
|          DAVID|  26|  Rio de Janeiro|Mexico|
|     LUIS ANGEL|  58|         Chennai|Mexico|
|       FERNANDO|  68|           Xi'an|Mexico|
|       EMMANUEL|  20|          Lahore|Mexico|
|MARIA GUADALUPE|  59|       Chongqing|Mexico|
|    MAXIMILIANO|  21|     Los Angeles|Mexico|
|       FERNANDA|  70|         Baoding|Mexico|
|      JOSE LUIS|  51|          London|Mexico|
|          ALEXA|  26|           Paris|Mexico|
|        RODRIGO|  62|           Linyi|Mexico|
|      ANA SOFIA|   3|        Dongguan|Mexico|
|         ANDREA|  16|       Hyderabad|Mexico|
|        EDUARDO|  18|         Tianjin|Mexico|
|     JOSE ANGEL|   8|            Lima|Mexico|
|     JUAN PABLO|  40|           Wuhan|Mexico|
|        GABRIEL|  49|         Nanyang|Mexico|
|       SAMANTHA|  41|        Hangzhou|Mexico|
|          DYLAN|  62|          Foshan|Mexico|
|      GUADALUPE|  69|          Nagoya|Mexico|
|    JUAN CARLOS|  29|          Taipei|Mexico|
|          TADEO|  22|        Tongshan|Mexico|
|        MELISSA|  15|          Luanda|Mexico|
|           AXEL|  20|         Zhoukou|Mexico|
|         RAFAEL|  40|         Ganzhou|Mexico|
|    JOSE MANUEL|  31|    Kuala Lumpur|Mexico|
|          ISAAC|  47|            Heze|Mexico|
|         ALEXIS|  24|        Quanzhou|Mexico|
|      ELIZABETH|  34|         Chicago|Mexico|
|        RICARDO|  47|         Nanjing|Mexico|
|         SAMUEL|  34|          Jining|Mexico|
|           IKER|  39|           Hanoi|Mexico|
|       JONATHAN|   9|            Pune|Mexico|
|         LEONEL|  32|          Fuyang|Mexico|
|        MARIANA|  19|       Ahmedabad|Mexico|
|         AITANA|  18|    Johannesburg|Mexico|
|         DAMIAN|  18|          Bogota|Mexico|
|         EMILIO|   8|   Dar es Salaam|Mexico|
|       YAMILETH|  54|        Shenyang|Mexico|
|           ALAN|  33|        Khartoum|Mexico|
|      FRANCISCO|  11|        Shangqiu|Mexico|
|          ELIAS|  31|        Cangzhou|Mexico|
|        NICOLAS|  48|       Hong Kong|Mexico|
|         FATIMA|  53|        Shaoyang|Mexico|
|       MAURICIO|   3|       Zhanjiang|Mexico|
|          EMILY|  31|        Yancheng|Mexico|
|  ANGEL GABRIEL|  53|        Hengyang|Mexico|
|   ANA VICTORIA|   4|          Riyadh|Mexico|
|       CRISTIAN|  64|       Zhumadian|Mexico|
|         ADRIAN|  42|        Santiago|Mexico|
|         CARLOS|  55|         Xingtai|Mexico|
|  LUIS FERNANDO|  69|      Chattogram|Mexico|
|        ABIGAIL|  17|           Bijie|Mexico|
|        ANTONIO|  10|        Shangrao|Mexico|
|         JAVIER|  35|           Zunyi|Mexico|
|      ALEJANDRA|   9|           Surat|Mexico|
|          JOSUE|  34|        Surabaya|Mexico|
|   JOSE ANTONIO|  66|       Huanggang|Mexico|
|        JULIETA|  15|         Maoming|Mexico|
|    JOSE MIGUEL|  48|        Nanchong|Mexico|
|      ESMERALDA|  26|         Xinyang|Mexico|
|        VANESSA|  30|          Madrid|Mexico|
|         MIGUEL|  70|         Baghdad|Mexico|
|         EVELYN|  30|          Qujing|Mexico|
|          URIEL|  36|         Jieyang|Mexico|
|      ESTEFANIA|  30|       Singapore|Mexico|
|          AARON|  46|       Prayagraj|Mexico|
|         JIMENA|  65|       Liaocheng|Mexico|
|           JUAN|   9|          Dalian|Mexico|
|         ANDRES|  30|           Yulin|Mexico|
|      ANA PAULA|  51|         Changde|Mexico|
|     JUAN DIEGO|  37|         Qingdao|Mexico|
|         JULIAN|  43|          Douala|Mexico|
+---------------+----+----------------+------+
only showing top 100 rows

5. Calcular el promedio de edad de todas las personas.

In [37]:
df.agg({'edad':'avg'}).show()

+-----------------+
|        avg(edad)|
+-----------------+
|36.54349627174813|
+-----------------+

6. Ordenar el DataFrame por edad en orden descendente.

In [39]:
from pyspark.sql.functions import *
# Sort the data in descending order.
df.sort(desc("edad")).show(5)

+----------------+----+-----------------+
|          nombre|edad|           ciudad|
+----------------+----+-----------------+
|         MARCELA|  72|             Lome|
|            MILA|  72|        Jalandhar|
|DAMIAN ALEJANDRO|  72|     Port Moresby|
|     JESUS MATEO|  72|          Huludao|
|     JOSE ARTURO|  72|King Edward Point|
+----------------+----+-----------------+
only showing top 5 rows

7. Agrupar por ciudad y calcular la cantidad de personas en cada ciudad.

In [40]:
(df.groupBy("ciudad")
    .agg(
        count("nombre").alias("personas_en_ciudad")
        ).show()
)

+------------+------------------+
|      ciudad|personas_en_ciudad|
+------------+------------------+
|   Bangalore|                 1|
|       Benxi|                 1|
|   Volgograd|                 1|
|     Morelia|                 1|
|   Kisangani|                 1|
|Thessaloniki|                 1|
|     Palermo|                 1|
|     Edogawa|                 1|
|      Linfen|                 1|
|    Cawnpore|                 1|
|   Tangerang|                 1|
|      Shiraz|                 1|
|    Voronezh|                 1|
|     Thu Duc|                 1|
|    Chisinau|                 1|
|     El Alto|                 1|
|    Jaboatao|                 1|
|       Cairo|                 1|
|  Casablanca|                 1|
| Zhangjiakou|                 1|
+------------+------------------+
only showing top 20 rows

8. Renombrar la columna "Nombre" a "NombreCompleto".

In [41]:
df.withColumnRenamed('nombre', 'Nombre Completo').show(100)

+---------------+----+----------------+
|Nombre Completo|edad|          ciudad|
+---------------+----+----------------+
|       SANTIAGO|  60|           Tokyo|
|          MATEO|  13|         Jakarta|
|          SOFIA|  63|           Delhi|
|      SEBASTIAN|  26|       Guangzhou|
|     MARIA JOSE|  51|          Mumbai|
|       LEONARDO|  15|          Manila|
|      VALENTINA|  21|        Shanghai|
|         REGINA|  25|       Sao Paulo|
|         XIMENA|  37|           Seoul|
|         MATIAS|  71|     Mexico City|
|         CAMILA|   4|           Cairo|
|       EMILIANO|   4|        New York|
|          DIEGO|  58|           Dhaka|
| MARIA FERNANDA|  41|         Beijing|
|   MIGUEL ANGEL|  18|         Kolkata|
|         DANIEL|  39|         Bangkok|
|        VALERIA|  37|        Shenzhen|
|         RENATA|  23|          Moscow|
|       VICTORIA|  29|    Buenos Aires|
|      ALEXANDER|  27|           Lagos|
|      ALEJANDRO|  43|        Istanbul|
|           GAEL|  48|         Karachi|
|          JESUS|  61|       Bangalore|
|        NATALIA|   4|Ho Chi Minh City|
|        DANIELA|  54|           Osaka|
|       ISABELLA|  49|         Chengdu|
|         ROMINA|   4|          Tehran|
|          ANGEL|  50|        Kinshasa|
|          DAVID|  26|  Rio de Janeiro|
|     LUIS ANGEL|  58|         Chennai|
|       FERNANDO|  68|           Xi'an|
|       EMMANUEL|  20|          Lahore|
|MARIA GUADALUPE|  59|       Chongqing|
|    MAXIMILIANO|  21|     Los Angeles|
|       FERNANDA|  70|         Baoding|
|      JOSE LUIS|  51|          London|
|          ALEXA|  26|           Paris|
|        RODRIGO|  62|           Linyi|
|      ANA SOFIA|   3|        Dongguan|
|         ANDREA|  16|       Hyderabad|
|        EDUARDO|  18|         Tianjin|
|     JOSE ANGEL|   8|            Lima|
|     JUAN PABLO|  40|           Wuhan|
|        GABRIEL|  49|         Nanyang|
|       SAMANTHA|  41|        Hangzhou|
|          DYLAN|  62|          Foshan|
|      GUADALUPE|  69|          Nagoya|
|    JUAN CARLOS|  29|          Taipei|
|          TADEO|  22|        Tongshan|
|        MELISSA|  15|          Luanda|
|           AXEL|  20|         Zhoukou|
|         RAFAEL|  40|         Ganzhou|
|    JOSE MANUEL|  31|    Kuala Lumpur|
|          ISAAC|  47|            Heze|
|         ALEXIS|  24|        Quanzhou|
|      ELIZABETH|  34|         Chicago|
|        RICARDO|  47|         Nanjing|
|         SAMUEL|  34|          Jining|
|           IKER|  39|           Hanoi|
|       JONATHAN|   9|            Pune|
|         LEONEL|  32|          Fuyang|
|        MARIANA|  19|       Ahmedabad|
|         AITANA|  18|    Johannesburg|
|         DAMIAN|  18|          Bogota|
|         EMILIO|   8|   Dar es Salaam|
|       YAMILETH|  54|        Shenyang|
|           ALAN|  33|        Khartoum|
|      FRANCISCO|  11|        Shangqiu|
|          ELIAS|  31|        Cangzhou|
|        NICOLAS|  48|       Hong Kong|
|         FATIMA|  53|        Shaoyang|
|       MAURICIO|   3|       Zhanjiang|
|          EMILY|  31|        Yancheng|
|  ANGEL GABRIEL|  53|        Hengyang|
|   ANA VICTORIA|   4|          Riyadh|
|       CRISTIAN|  64|       Zhumadian|
|         ADRIAN|  42|        Santiago|
|         CARLOS|  55|         Xingtai|
|  LUIS FERNANDO|  69|      Chattogram|
|        ABIGAIL|  17|           Bijie|
|        ANTONIO|  10|        Shangrao|
|         JAVIER|  35|           Zunyi|
|      ALEJANDRA|   9|           Surat|
|          JOSUE|  34|        Surabaya|
|   JOSE ANTONIO|  66|       Huanggang|
|        JULIETA|  15|         Maoming|
|    JOSE MIGUEL|  48|        Nanchong|
|      ESMERALDA|  26|         Xinyang|
|        VANESSA|  30|          Madrid|
|         MIGUEL|  70|         Baghdad|
|         EVELYN|  30|          Qujing|
|          URIEL|  36|         Jieyang|
|      ESTEFANIA|  30|       Singapore|
|          AARON|  46|       Prayagraj|
|         JIMENA|  65|       Liaocheng|
|           JUAN|   9|          Dalian|
|         ANDRES|  30|           Yulin|
|      ANA PAULA|  51|         Changde|
|     JUAN DIEGO|  37|         Qingdao|
|         JULIAN|  43|          Douala|
+---------------+----+----------------+
only showing top 100 rows

9. Eliminar la columna "Edad" del DataFrame.

In [42]:
newdf = df.drop("edad")
newdf.show(100)

+---------------+----------------+
|         nombre|          ciudad|
+---------------+----------------+
|       SANTIAGO|           Tokyo|
|          MATEO|         Jakarta|
|          SOFIA|           Delhi|
|      SEBASTIAN|       Guangzhou|
|     MARIA JOSE|          Mumbai|
|       LEONARDO|          Manila|
|      VALENTINA|        Shanghai|
|         REGINA|       Sao Paulo|
|         XIMENA|           Seoul|
|         MATIAS|     Mexico City|
|         CAMILA|           Cairo|
|       EMILIANO|        New York|
|          DIEGO|           Dhaka|
| MARIA FERNANDA|         Beijing|
|   MIGUEL ANGEL|         Kolkata|
|         DANIEL|         Bangkok|
|        VALERIA|        Shenzhen|
|         RENATA|          Moscow|
|       VICTORIA|    Buenos Aires|
|      ALEXANDER|           Lagos|
|      ALEJANDRO|        Istanbul|
|           GAEL|         Karachi|
|          JESUS|       Bangalore|
|        NATALIA|Ho Chi Minh City|
|        DANIELA|           Osaka|
|       ISABELLA|         Chengdu|
|         ROMINA|          Tehran|
|          ANGEL|        Kinshasa|
|          DAVID|  Rio de Janeiro|
|     LUIS ANGEL|         Chennai|
|       FERNANDO|           Xi'an|
|       EMMANUEL|          Lahore|
|MARIA GUADALUPE|       Chongqing|
|    MAXIMILIANO|     Los Angeles|
|       FERNANDA|         Baoding|
|      JOSE LUIS|          London|
|          ALEXA|           Paris|
|        RODRIGO|           Linyi|
|      ANA SOFIA|        Dongguan|
|         ANDREA|       Hyderabad|
|        EDUARDO|         Tianjin|
|     JOSE ANGEL|            Lima|
|     JUAN PABLO|           Wuhan|
|        GABRIEL|         Nanyang|
|       SAMANTHA|        Hangzhou|
|          DYLAN|          Foshan|
|      GUADALUPE|          Nagoya|
|    JUAN CARLOS|          Taipei|
|          TADEO|        Tongshan|
|        MELISSA|          Luanda|
|           AXEL|         Zhoukou|
|         RAFAEL|         Ganzhou|
|    JOSE MANUEL|    Kuala Lumpur|
|          ISAAC|            Heze|
|         ALEXIS|        Quanzhou|
|      ELIZABETH|         Chicago|
|        RICARDO|         Nanjing|
|         SAMUEL|          Jining|
|           IKER|           Hanoi|
|       JONATHAN|            Pune|
|         LEONEL|          Fuyang|
|        MARIANA|       Ahmedabad|
|         AITANA|    Johannesburg|
|         DAMIAN|          Bogota|
|         EMILIO|   Dar es Salaam|
|       YAMILETH|        Shenyang|
|           ALAN|        Khartoum|
|      FRANCISCO|        Shangqiu|
|          ELIAS|        Cangzhou|
|        NICOLAS|       Hong Kong|
|         FATIMA|        Shaoyang|
|       MAURICIO|       Zhanjiang|
|          EMILY|        Yancheng|
|  ANGEL GABRIEL|        Hengyang|
|   ANA VICTORIA|          Riyadh|
|       CRISTIAN|       Zhumadian|
|         ADRIAN|        Santiago|
|         CARLOS|         Xingtai|
|  LUIS FERNANDO|      Chattogram|
|        ABIGAIL|           Bijie|
|        ANTONIO|        Shangrao|
|         JAVIER|           Zunyi|
|      ALEJANDRA|           Surat|
|          JOSUE|        Surabaya|
|   JOSE ANTONIO|       Huanggang|
|        JULIETA|         Maoming|
|    JOSE MIGUEL|        Nanchong|
|      ESMERALDA|         Xinyang|
|        VANESSA|          Madrid|
|         MIGUEL|         Baghdad|
|         EVELYN|          Qujing|
|          URIEL|         Jieyang|
|      ESTEFANIA|       Singapore|
|          AARON|       Prayagraj|
|         JIMENA|       Liaocheng|
|           JUAN|          Dalian|
|         ANDRES|           Yulin|
|      ANA PAULA|         Changde|
|     JUAN DIEGO|         Qingdao|
|         JULIAN|          Douala|
+---------------+----------------+
only showing top 100 rows

10. Realizar una consulta SQL en el DataFrame para seleccionar personas mayores de 20 años.

In [43]:
# Register DataFrame as Temporary Table
df.createOrReplaceTempView("temp_table")

# Execute SQL-Like query.
spark.sql("select * from temp_table where edad > 20").show()

+--------------+----+------------+
|        nombre|edad|      ciudad|
+--------------+----+------------+
|      SANTIAGO|  60|       Tokyo|
|         SOFIA|  63|       Delhi|
|     SEBASTIAN|  26|   Guangzhou|
|    MARIA JOSE|  51|      Mumbai|
|     VALENTINA|  21|    Shanghai|
|        REGINA|  25|   Sao Paulo|
|        XIMENA|  37|       Seoul|
|        MATIAS|  71| Mexico City|
|         DIEGO|  58|       Dhaka|
|MARIA FERNANDA|  41|     Beijing|
|        DANIEL|  39|     Bangkok|
|       VALERIA|  37|    Shenzhen|
|        RENATA|  23|      Moscow|
|      VICTORIA|  29|Buenos Aires|
|     ALEXANDER|  27|       Lagos|
|     ALEJANDRO|  43|    Istanbul|
|          GAEL|  48|     Karachi|
|         JESUS|  61|   Bangalore|
|       DANIELA|  54|       Osaka|
|      ISABELLA|  49|     Chengdu|
+--------------+----+------------+
only showing top 20 rows

11. Calcular la suma total de todas las edades.

In [44]:
df.agg({'edad':'sum'}).show()

+---------+
|sum(edad)|
+---------+
|    44108|
+---------+

12. Calcular la edad mínima y máxima de todas las personas.

In [46]:
df.agg({'edad':'min'}).show()

+---------+
|min(edad)|
+---------+
|        1|
+---------+

In [47]:
df.agg({'edad':'max'}).show()

+---------+
|max(edad)|
+---------+
|       72|
+---------+

13. Filtrar personas cuya ciudad de residencia sea "Chicago" y edad sea menor de 30.

In [48]:
# Register DataFrame as Temporary Table
df.createOrReplaceTempView("temp_table")

# Execute SQL-Like query.
spark.sql("select * from temp_table where edad < 30 and ciudad='Chicago' ").show()

+------+----+------+
|nombre|edad|ciudad|
+------+----+------+
+------+----+------+

14. Agregar una nueva columna "EdadDuplicada" que contenga el doble de la edad.

In [50]:
df.withColumn('EdadDuplicada', df['edad'] * 2).show()

+--------------+----+------------+-------------+
|        nombre|edad|      ciudad|EdadDuplicada|
+--------------+----+------------+-------------+
|      SANTIAGO|  60|       Tokyo|          120|
|         MATEO|  13|     Jakarta|           26|
|         SOFIA|  63|       Delhi|          126|
|     SEBASTIAN|  26|   Guangzhou|           52|
|    MARIA JOSE|  51|      Mumbai|          102|
|      LEONARDO|  15|      Manila|           30|
|     VALENTINA|  21|    Shanghai|           42|
|        REGINA|  25|   Sao Paulo|           50|
|        XIMENA|  37|       Seoul|           74|
|        MATIAS|  71| Mexico City|          142|
|        CAMILA|   4|       Cairo|            8|
|      EMILIANO|   4|    New York|            8|
|         DIEGO|  58|       Dhaka|          116|
|MARIA FERNANDA|  41|     Beijing|           82|
|  MIGUEL ANGEL|  18|     Kolkata|           36|
|        DANIEL|  39|     Bangkok|           78|
|       VALERIA|  37|    Shenzhen|           74|
|        RENATA|  23|      Moscow|           46|
|      VICTORIA|  29|Buenos Aires|           58|
|     ALEXANDER|  27|       Lagos|           54|
+--------------+----+------------+-------------+
only showing top 20 rows

15. Convertir todas las edades en años a meses.

In [51]:
df.withColumn('EdadEnMeses', df['edad'] * 12).show()

+--------------+----+------------+-----------+
|        nombre|edad|      ciudad|EdadEnMeses|
+--------------+----+------------+-----------+
|      SANTIAGO|  60|       Tokyo|        720|
|         MATEO|  13|     Jakarta|        156|
|         SOFIA|  63|       Delhi|        756|
|     SEBASTIAN|  26|   Guangzhou|        312|
|    MARIA JOSE|  51|      Mumbai|        612|
|      LEONARDO|  15|      Manila|        180|
|     VALENTINA|  21|    Shanghai|        252|
|        REGINA|  25|   Sao Paulo|        300|
|        XIMENA|  37|       Seoul|        444|
|        MATIAS|  71| Mexico City|        852|
|        CAMILA|   4|       Cairo|         48|
|      EMILIANO|   4|    New York|         48|
|         DIEGO|  58|       Dhaka|        696|
|MARIA FERNANDA|  41|     Beijing|        492|
|  MIGUEL ANGEL|  18|     Kolkata|        216|
|        DANIEL|  39|     Bangkok|        468|
|       VALERIA|  37|    Shenzhen|        444|
|        RENATA|  23|      Moscow|        276|
|      VICTORIA|  29|Buenos Aires|        348|
|     ALEXANDER|  27|       Lagos|        324|
+--------------+----+------------+-----------+
only showing top 20 rows

16. Contar el número total de personas en el DataFrame.

In [53]:
df.count()

1207

17. Filtrar personas cuya edad sea un número par.

In [57]:
df.filter(df['edad'] % 2 == 0).show()

+------------+----+----------------+
|      nombre|edad|          ciudad|
+------------+----+----------------+
|    SANTIAGO|  60|           Tokyo|
|   SEBASTIAN|  26|       Guangzhou|
|      CAMILA|   4|           Cairo|
|    EMILIANO|   4|        New York|
|       DIEGO|  58|           Dhaka|
|MIGUEL ANGEL|  18|         Kolkata|
|        GAEL|  48|         Karachi|
|     NATALIA|   4|Ho Chi Minh City|
|     DANIELA|  54|           Osaka|
|      ROMINA|   4|          Tehran|
|       ANGEL|  50|        Kinshasa|
|       DAVID|  26|  Rio de Janeiro|
|  LUIS ANGEL|  58|         Chennai|
|    FERNANDO|  68|           Xi'an|
|    EMMANUEL|  20|          Lahore|
|    FERNANDA|  70|         Baoding|
|       ALEXA|  26|           Paris|
|     RODRIGO|  62|           Linyi|
|      ANDREA|  16|       Hyderabad|
|     EDUARDO|  18|         Tianjin|
+------------+----+----------------+
only showing top 20 rows

18. Calcular la cantidad de personas por rango de edades (0-20, 21-40, 41-60, 61+).

In [66]:
print("En rango de 0-20")
df.filter(df.edad.between(0,20)).count()

En rango de 0-20

330

In [68]:
print("En rango de 21-40")
df.filter(df.edad.between(21,40)).count()

En rango de 21-40

332

In [69]:
print("En rango de 41-60")
df.filter(df.edad.between(41,60)).count()

En rango de 41-60

349

In [70]:
print("En rango de 61+")
df.filter(df.edad > 60).count()

En rango de 61+

196

19. Contar cuántas personas tienen el mismo nombre.

In [72]:
df.groupBy('nombre').agg(count('nombre').alias('cuantos')).show()

+------------------+-------+
|            nombre|cuantos|
+------------------+-------+
|        JUAN PABLO|      1|
|         JUAN JOSE|      1|
|              JADE|      1|
|        IAN DANIEL|      1|
| SANTIAGO DE JESUS|      1|
|             AILYN|      1|
|      LUIS ROBERTO|      1|
|           EMANUEL|      1|
|     ZOE VALENTINA|      1|
|       JESUS ANGEL|      1|
|             FREDY|      1|
|     CARLOS ALEXIS|      1|
|             MATEO|      1|
|          FERNANDA|      1|
|  MARIA DEL CARMEN|      1|
|       DYLAN MATEO|      1|
|            EVELIN|      1|
|SAMANTHA GUADALUPE|      1|
|  ALISON GUADALUPE|      1|
|        JOSE ANGEL|      1|
+------------------+-------+
only showing top 20 rows

20. Concatenar las columnas "Nombre" y "Ciudad" en una nueva columna llamada "InformacionPersonal".

In [80]:
df.withColumn("InformacionPersonal", concat(col('nombre'),lit(" "),col('ciudad'))).show()

+--------------+----+------------+--------------------+
|        nombre|edad|      ciudad| InformacionPersonal|
+--------------+----+------------+--------------------+
|      SANTIAGO|  60|       Tokyo|      SANTIAGO Tokyo|
|         MATEO|  13|     Jakarta|       MATEO Jakarta|
|         SOFIA|  63|       Delhi|         SOFIA Delhi|
|     SEBASTIAN|  26|   Guangzhou| SEBASTIAN Guangzhou|
|    MARIA JOSE|  51|      Mumbai|   MARIA JOSE Mumbai|
|      LEONARDO|  15|      Manila|     LEONARDO Manila|
|     VALENTINA|  21|    Shanghai|  VALENTINA Shanghai|
|        REGINA|  25|   Sao Paulo|    REGINA Sao Paulo|
|        XIMENA|  37|       Seoul|        XIMENA Seoul|
|        MATIAS|  71| Mexico City|  MATIAS Mexico City|
|        CAMILA|   4|       Cairo|        CAMILA Cairo|
|      EMILIANO|   4|    New York|   EMILIANO New York|
|         DIEGO|  58|       Dhaka|         DIEGO Dhaka|
|MARIA FERNANDA|  41|     Beijing|MARIA FERNANDA Be...|
|  MIGUEL ANGEL|  18|     Kolkata|MIGUEL ANGEL Kolkata|
|        DANIEL|  39|     Bangkok|      DANIEL Bangkok|
|       VALERIA|  37|    Shenzhen|    VALERIA Shenzhen|
|        RENATA|  23|      Moscow|       RENATA Moscow|
|      VICTORIA|  29|Buenos Aires|VICTORIA Buenos A...|
|     ALEXANDER|  27|       Lagos|     ALEXANDER Lagos|
+--------------+----+------------+--------------------+
only showing top 20 rows